## Production: cognito
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          NAME                          |
|----------|--------------------------------------------------------|
| recreate | `aws_lambda_layer_version.cognito_email_sender_nodejs` |
| update   | `aws_cognito_user_pool_client.forms`                   |
|          | `aws_lambda_function.cognito_email_sender`             |
|          | `aws_lambda_function.cognito_pre_sign_up`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cognito_user_pool_client.forms will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "forms" {
      ~ callback_urls                        = [
          - "https://forms-formulaires.canada.ca/api/auth/callback/cognito",
            # (2 unchanged elements hidden)
        ]
        id                                   = "5rkjd3us3ocssieiitdbtjitiv"
        name                                 = "forms_client"
        # (14 unchanged attributes hidden)
    }

  # aws_lambda_function.cognito_email_sender will be updated in-place
  ~ resource "aws_lambda_function" "cognito_email_sender" {
        id                             = "Cognito_Email_Sender"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:6",
        ] -> (known after apply)
      ~ runtime                        = "nodejs16.x" -> "nodejs18.x"
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_pre_sign_up will be updated in-place
  ~ resource "aws_lambda_function" "cognito_pre_sign_up" {
        id                             = "Cognito_Pre_Sign_Up"
      ~ runtime                        = "nodejs16.x" -> "nodejs18.x"
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_layer_version.cognito_email_sender_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "cognito_email_sender_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ compatible_runtimes         = [ # forces replacement
          - "nodejs16.x",
          + "nodejs18.x",
        ]
      ~ created_date                = "2023-09-19T18:53:44.051+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "qs5cRdZWWVSfafohxew27cuy4hk3mS87FPivY+FhcwQ=" -> "ds9qa4ZKrb4ykZpLYXSUy9muksxn2P5zC1R84FonZQE=" # forces replacement
      ~ source_code_size            = 14750107 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_email_sender"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_pre_sign_up"]
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
